In [1]:
import pandas as pd

In [3]:
df= pd.Dataframe(
   {
       "Name":[
           "Anushka,Miss Ayra Azim",
           "Riju,Mr. Ahmed",
           "Radi,Mr. Azad",
       ],
        "Age":[22, 24, 18],
        "Sex":["female", "male","male"],
   }
)

AttributeError: module 'pandas' has no attribute 'Dataframe'

In [4]:
import pandas as pd

In [5]:
 df = pd.DataFrame(
        {
           "Name": [
              "Braund, Mr. Owen Harris",
                "Allen, Mr. William Henry",
               "Bonnell, Miss. Elizabeth",
            ],
           "Age": [22, 35, 58],
           "Sex": ["male", "male", "female"],
       }
   )

In [6]:
 df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [7]:
import pandas as pd

In [8]:
 df = pd.DataFrame(
       {
           "Name": [
               "Anu,miss azad",
               "Radi, mr. khan",
               "mili,miss. salma",
           ],
           "Age": [22, 17,35],
           "Sex": ["female", "male","female"],
       }
 )

In [9]:
 df

               Name  Age     Sex
0     Anu,miss azad   22  female
1    Radi, mr. khan   17    male
2  mili,miss. salma   35  female

In [11]:
df["Age"]

0    22
1    17
2    35
Name: Age, dtype: int64

In [12]:
df["Sex"]

0    female
1      male
2    female
Name: Sex, dtype: object

In [14]:
ages = pd.Series([22, 17,35], name="Age")

In [15]:
ages

0    22
1    17
2    35
Name: Age, dtype: int64

In [16]:
df["Age"].max()

35

In [17]:
df["Age"].min()

17

In [18]:
df.describe()

             Age
count   3.000000
mean   24.666667
std     9.291573
min    17.000000
25%    19.500000
50%    22.000000
75%    28.500000
max    35.000000